export enum OpenAiPrompts {
  START = 'Користувач розпочав взаємодію з ботом. Напиши привітальне повідомлення, в якому пояснюється, що бот допомагає з оформленням автострахування. Попроси користувача надіслати фото паспорта та техпаспорта.',
  CONFIRM_PRICE_YES = 'Користувач погодився на запропоновану ціну автострахування. Відповідь має бути короткою, ввічливою та підтверджувати прийом замовлення.',
  CONFIRM_PRICE_NO = 'Користувач не погодився з ціною автострахування. Повідом, що ціна фіксована і становить 100 USD. Зроби це ввічливо, але чітко.',
  DATA_CONFIRMATION = 'Користувач підтвердив, що дані, зчитані з документів, є правильними. Подякуй за підтвердження та повідом, що зараз буде запропонована ціна.',
  DATA_REJECTED = 'Користувач відхилив дані з документів. Попроси зробити нове фото та надіслати його повторно для зчитування інформації.',
  SEND_PRICE = 'Повідом користувачу, що вартість автострахування є фіксованою і складає 100 USD. Запитай, чи погоджується він з цією ціною.',
  POLICY_GENERATION = 'Користувач погодився на все і оформив автострахування. Створи короткий шаблон поліса автострахування, згенерований штучним інтелектом. Використовуй формальний і офіційний стиль.',
  DOCUMENT_UPLOAD_INSUFFICIENT = 'Пользователь загрузил недостаточно фото. Попроси загрузить еще.',
  DOCUMENT_UPLOAD_SUCCESS = 'Пользователь успешно загрузил все документы. Подтвердите успешную загрузку.',
  ERROR = 'Произошла ошибка при обработке вашего запроса. Попробуйте позже.',
  INVALID_PASSPORT_DATA = 'Фото паспорта пользователя не прошли валидацию. Пожалуйста, сообщите об этом.',
  CONFIRMATION = 'Пользователь завершил процесс загрузки документов. Сгенерируйте сообщение с подтверждением и информацией о страховом полисе.',
}
